akilaid/esp-hid/firmware-idf/sdkconfig.defaults
# ESP-HID bridge — ESP32-C3 + NimBLE BLE HID device.

CONFIG_IDF_TARGET="esp32c3"

# --- Bluetooth / NimBLE ---
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# nimble_hidd.c (the esp_hid BLE device backend) is compiled out without this;
# it defaults to n. Without it esp_hidd_dev_init(BLE) does not exist.
CONFIG_BT_NIMBLE_HID_SERVICE=y
CONFIG_BT_NIMBLE_SVC_HID_MAX_RPTS=4
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=3
# Bonds persist across reboots (NVS).
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_SM_SC=y
# Peripheral-only device.
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n

# --- Task stacks ---
# esp_hidd_dev_init() parses the report map and registers a GATT
# characteristic per report, all on the caller's stack — which is app_main's.
# The IDF default of 3584 leaves so little headroom that adding ONE report to
# hid_report_map overflows it, and the failure is invisible: the panic is a
# stack protection fault written to the UART0 console, which nothing is
# listening to, so the board just boot-loops with no output over USB. Measured
# while prototyping an extra report; 8192 costs ~4.5 KB of ~164 KB free.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- Console ---
# The USB Serial/JTAG CDC port carries the binary bridge protocol; nothing
# else may write to it. Logs go to UART0 (TX=GPIO21, RX=GPIO20). The C3
# default routes a SECONDARY console to USB Serial/JTAG — disable it.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- Flash / partitions ---
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
